Autodesk.Revit.DB.RelatedFileResult
Gives the result of creating a related file.
Since:
2014

Autodesk.Revit.DB.RelatedFileResult.Canceled
The user canceled the operation.

Autodesk.Revit.DB.RelatedFileResult.Failed
We were unable to create the related file

Autodesk.Revit.DB.RelatedFileResult.LowSpace
There is not enough space to complete the operation.

Autodesk.Revit.DB.RelatedFileResult.Succeeded
We created the related file